{"posts":[{"title":"The last TOEIC exam: Came up a bit short!","text":"TOEIC Result of the 309th TOEIC exam Test date: Sunday, Nov/20th/2022 My personal best was a test I took right after I came back from studying in Canada, which I took online, I believe, and scored 745. I think I got about a 470 in listening and my reading score was a wreck,… This time, I took the test with the aim of scoring over 800 points, as a certain company’s entry criteria is TOEIC score of 800 points. During the test, I felt that I was able to listen well and read English sentences! I felt like I thought to myself, “This must be 900 or so.” I was so happy. I waited for about 2 weeks with a happy feeling. The result of my expectation was…boom! Oh, come on, not at all! Also, I was still dragged down by my poor reading. What was that feeling of being able to? lol. Well, but. I feel like I’ve grown up a bit, or rather, moved forward. Besides, I was able to beat my personal best, and, I believe, I can reach 800 points if I work hard one more step. I guess what I need at the moment is a quick but causal analysis. I also need to improve the fact that I haven’t been able to spend much time each day even for English study. I’ll make a notebook of items to reflect on and change the way I’ve been doing things. Next time, I will take the 313th exam on January 29th, and I will get my revenge 800 points. I will do my best.","link":"/2022/12/17/english-study/"},{"title":"Building my home lab: Architecture","text":"v1.0.0 v2.0.0","link":"/2022/12/19/m2lab-architecture/"}],"tags":[{"name":"TOEIC","slug":"TOEIC","link":"/tags/TOEIC/"},{"name":"HomeLab","slug":"HomeLab","link":"/tags/HomeLab/"}],"categories":[{"name":"Language learning","slug":"Language-learning","link":"/categories/Language-learning/"},{"name":"My Home Lab","slug":"My-Home-Lab","link":"/categories/My-Home-Lab/"},{"name":"English","slug":"Language-learning/English","link":"/categories/Language-learning/English/"},{"name":"architecture","slug":"My-Home-Lab/architecture","link":"/categories/My-Home-Lab/architecture/"}],"pages":[{"title":"devops","text":"comming soon…","link":"/devops/index.html"},{"title":"ml","text":"comming soon…","link":"/ml/index.html"},{"title":"reviews","text":"comming soon…","link":"/reviews/index.html"},{"title":"apps","text":"comming soon…","link":"/apps/index.html"}]}